app/Controllers/Admin.php

    public function dashboard()
    {
        $userModel = new User_model();
        $subModel = new Subject_model();

        $leaveModel = new \App\Models\LeaveRequestModel();
        $activityModel = new \App\Models\ActivityLogModel();

        $data = [
            'title' => 'Admin Dashboard',
            'stats' => [
                'students' => $userModel->where('role', 'student')->countAllResults(),
                'faculty'  => $userModel->where('role', 'faculty')->countAllResults(),
                'hods'     => $userModel->where('role', 'hod')->countAllResults(),
                'subjects' => $subModel->countAll(),
            ],
            'pendingLeavesCount' => $leaveModel->where('status', 'Pending')->countAllResults(),
            'totalActivities' => $activityModel->countAllResults(),
            'recentStudents' => $userModel->where('role', 'student')->orderBy('created_at', 'DESC')->limit(5)->findAll(),
            'totalAssignments' => $subModel->db->table('faculty_subjects')->countAllResults(),
            'recentLeaves' => $leaveModel->select('leave_requests.*, users.name as faculty_name')
                ->join('users', 'users.id = leave_requests.faculty_id')
                ->orderBy('leave_requests.created_at', 'DESC')
                ->limit(5)->findAll()
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'faculty'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'hod'
SELECT COUNT(*) AS `numrows` FROM `subjects`
SELECT COUNT(*) AS `numrows`
FROM `leave_requests`
WHERE `status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `activity_logs`
SELECT *
FROM `users`
WHERE `role` = 'student'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `faculty_subjects`
SELECT `leave_requests`.*, `users`.`name` as `faculty_name`
FROM `leave_requests`
JOIN `users` ON `users`.`id` = `leave_requests`.`faculty_id`
ORDER BY `leave_requests`.`created_at` DESC
 LIMIT 5

    public function manageFaculty()
    {
        $userModel = new User_model();
        $data = [
            'title' => 'Manage Faculty',
            'faculty' => $userModel->where('role', 'faculty')->findAll()
---
SELECT *
FROM `users`
WHERE `role` = 'faculty'