app/Controllers/BusController.php

SELECT *
FROM `bus_routes`
SELECT *
FROM `bus_stops`
---
    public function studentBus()
    {
        $studentId = session()->get('id');
        $myBusInfo = $this->studentBusModel->getStudentBusInfo($studentId);

        $allRoutes = $this->busRouteModel->findAll();
        $allStops = $this->busStopModel->findAll();