app/Controllers/ChatAPI.php

    public function getConversations()
    {
        $userId = session()->get('id');
        $conversations = $this->convModel->getConversationsForUser($userId);

        foreach ($conversations as &$conv) {
            if ($conv['type'] === 'direct') {
                // Find the other participant to show their name/avatar
                $otherParticipant = $this->db->table('chat_participants cp')
                    ->select('u.name, u.last_seen')
                    ->join('users u', 'u.id = cp.user_id')
                    ->where('cp.conversation_id', $conv['id'])
                    ->where('cp.user_id !=', $userId)
                    ->get()
                    ->getRowArray();

                if ($otherParticipant) {
                    $conv['display_name'] = $otherParticipant['name'];
                    $conv['is_online'] = $this->isUserOnline($otherParticipant['last_seen']);
                }
            } else {
                $conv['display_name'] = $conv['name'];
            }

            // Get last message preview
            $lastMsg = $this->db->table('chat_messages')
                ->where('conversation_id', $conv['id'])
                ->where('is_deleted', 0)
                ->orderBy('created_at', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();
---
SELECT `u`.`name`, `u`.`last_seen`
FROM `chat_participants` `cp`
JOIN `users` `u` ON `u`.`id` = `cp`.`user_id`
WHERE `cp`.`conversation_id` = '1'
AND `cp`.`user_id` != '12'
SELECT *
FROM `chat_messages`
WHERE `conversation_id` = '1'
AND `is_deleted` = 0
ORDER BY `created_at` DESC
 LIMIT 1

                $conv['last_message'] = $lastMsg;
                // Add status to last message
                if ($lastMsg['sender_id'] == $userId) {
                    $otherPart = $this->db->table('chat_participants')
                        ->where('conversation_id', $conv['id'])
                        ->where('user_id !=', $userId)
                        ->get()
                        ->getRowArray();
---
SELECT *
FROM `chat_participants`
WHERE `conversation_id` = '1'
AND `user_id` != '12'

    public function pollNewMessages($id)
    {
        $userId = session()->get('id');
        if (!$this->convModel->isParticipant($id, $userId)) {
            return $this->failForbidden();
        }

        $lastMsgId = $this->request->getGet('last_id');
        $newMessages = $this->msgModel->getNewMessagesSince($id, $lastMsgId);

        if (!empty($newMessages)) {
            // Mark these new messages as delivered
            $this->db->table('chat_messages')
                ->where('conversation_id', $id)
                ->where('sender_id !=', $userId)
                ->where('delivered_at', null)
                ->update(['delivered_at' => date('Y-m-d H:i:s')]);

            // Mark as read if we got new messages
            $this->convModel->markAsRead($id, $userId);

            $lastMsg = end($newMessages);
            $this->db->table('chat_participants')
                ->where('conversation_id', $id)
                ->where('user_id', $userId)
                ->update(['last_read_message_id' => $lastMsg['id']]);
        }

        // Status check for existing messages (to see if they were just read)
        $otherPart = $this->db->table('chat_participants')
            ->where('conversation_id', $id)
            ->where('user_id !=', $userId)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `chat_participants`
WHERE `conversation_id` = '3'
AND `user_id` != '12'

    public function updateHeartbeat()
    {
        $userId = session()->get('id');
        $this->db->table('users')
            ->where('id', $userId)
            ->update(['last_seen' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_seen` = '2026-04-11 10:55:03'
WHERE `id` = '4'