app/Controllers/Chat.php

    public function index()
    {
        $userModel = new User_model();
        $convModel = new ConversationModel();

        $userId = session()->get('id');

        $data = [
            'title' => 'CampusPro Chat',
            'currentUser' => $userModel->find($userId),
            'allUsers' => $userModel->where('id !=', $userId)->findAll(),
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'
SELECT *
FROM `users`
WHERE `id` != '4'