app/Controllers/Courses.php

SELECT *
FROM `courses`
WHERE `status` = 'Active'
AND `courses`.`deleted_at` IS NULL
SELECT *
FROM `courses`
WHERE `courses`.`deleted_at` IS NULL
---
    public function index()
    {
        $role = session()->get('role');
        $department = session()->get('department');

        if ($role === 'faculty' || $role === 'hod') {
            $courses = $this->courseModel->getByDepartment($department);
            $title = 'Departmental Courses';
        }
        elseif ($role === 'student') {
            // For students, show all active courses globally or filter by semester if we had it
            // Assuming for now they see all active courses in the catalogue
            $courses = $this->courseModel->where('status', 'Active')->findAll();
            $title = 'Course Catalogue';
        }

        // Context for Quick Actions if faculty
        $assignedSubjectIds = [];
        if ($role === 'faculty') {
            $subModel = new \App\Models\Subject_model();
            $assigned = $subModel->getAssignedSubjects(session()->get('id'));
            // Map names to IDs for easier lookup in the view
            foreach($assigned as $s) {
                $assignedSubjectIds[strtolower($s['subject_name'])] = $s['id'];
            }
        }
        else {
            $courses = $this->courseModel->findAll();

INSERT INTO `courses` (`course_code`, `course_name`, `department`, `semester`, `credits`, `status`, `created_at`, `updated_at`) VALUES ('ME3401', 'Fluid Mechanics and Machinery', 'Mechanical Engineering', '3', '4', 'Active', '2026-04-10 13:09:47', '2026-04-10 13:09:47')
---
    public function store()
    {
        $rules = $this->courseModel->getValidationRules();

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'course_code' => $this->request->getPost('course_code'),
            'course_name' => $this->request->getPost('course_name'),
            'department' => $this->request->getPost('department'),
            'semester' => $this->request->getPost('semester'),
            'credits' => $this->request->getPost('credits'),
            'status' => $this->request->getPost('status'),
        ];

        if ($this->courseModel->insert($data)) {