app/Controllers/Student.php

    public function dashboard()
    {
        $student_id = session()->get('id');
        $marksModel = new Marks_model();
        $leaveModel = new \App\Models\StudentLeaveModel();
        $docModel = new \App\Models\Student_document_model();
        $subModel = new \App\Models\Subject_model();

        $data = [
            'title' => 'Student Dashboard',
            'marks' => $marksModel->getStudentMarks($student_id),
            'stats' => [
                'pending_leaves' => $leaveModel->where('student_id', $student_id)->where('status', 'Pending')->countAllResults(),
                'total_docs'     => $docModel->where('student_id', $student_id)->countAllResults(),
                'enrolled_subs'  => $subModel->countAll(),
            ],
            'recentLogs' => (new \App\Models\ActivityLogModel())->where('user_id', $student_id)->orderBy('created_at', 'DESC')->limit(5)->findAll()
---
SELECT *
FROM `activity_logs`
WHERE `user_id` = '4'
ORDER BY `created_at` DESC
 LIMIT 5

    public function profile()
    {
        $userModel = new User_model();
        $reqModel = new \App\Models\ProfileRequestModel();

        $studentId = session()->get('id');
        $user = $userModel->find($studentId);

        $data = [
            'title' => 'Student Profile',
            'user' => $user,
            'facultyList' => $userModel->where('role', 'faculty')->findAll(),
            'pendingRequest' => $reqModel->where('student_id', $studentId)->where('status', 'pending')->first(),
---
SELECT *
FROM `users`
WHERE `users`.`id` = '12'
SELECT *
FROM `users`
WHERE `role` = 'faculty'
SELECT *
FROM `profile_requests`
WHERE `student_id` = '12'
AND `status` = 'rejected'
ORDER BY `created_at` DESC
 LIMIT 1

    public function viewAnswerUpload()
    {
        $subModel = new \App\Models\Subject_model();
        $ansModel = new \App\Models\Answer_sheet_model();
        $studentId = session()->get('id');

        $pastSubmissions = $ansModel->select('answer_sheets.subject_id, answer_sheets.created_at, answer_sheets.status, subjects.subject_name, count(answer_sheets.id) as page_count')
                                    ->join('subjects', 'subjects.id = answer_sheets.subject_id')
                                    ->where('answer_sheets.student_id', $studentId)
                                    ->groupBy('answer_sheets.subject_id, answer_sheets.created_at, answer_sheets.status, subjects.subject_name')
                                    ->orderBy('answer_sheets.created_at', 'DESC')
                                    ->findAll();

        $data = [
            'title' => 'Upload Answer Sheet',
            'subjects' => $subModel->findAll(), // Ideally only subjects the student is registered for
            'submissions' => $pastSubmissions
        ];
---
SELECT `answer_sheets`.`subject_id`, `answer_sheets`.`created_at`, `answer_sheets`.`status`, `subjects`.`subject_name`, count(answer_sheets.id) as page_count
FROM `answer_sheets`
JOIN `subjects` ON `subjects`.`id` = `answer_sheets`.`subject_id`
WHERE `answer_sheets`.`student_id` = '4'
GROUP BY `answer_sheets`.`subject_id`, `answer_sheets`.`created_at`, `answer_sheets`.`status`, `subjects`.`subject_name`
ORDER BY `answer_sheets`.`created_at` DESC
SELECT *
FROM `subjects`