app/Models/ActivityLogModel.php

    public function logActivity($user_id, $action, $description = '')
    {
        // Verify user exists to satisfy foreign key constraint
        $db = \Config\Database::connect();
        $userExists = $db->table('users')->where('id', $user_id)->countAllResults();

        $data = [
            'user_id' => $userExists ? $user_id : null,
            'action'  => $action,
            'description' => $description,
            'ip_address' => $_SERVER['REMOTE_ADDR']
        ];
        return $this->db->table($this->table)->insert($data);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` = '2'
INSERT INTO `activity_logs` (`user_id`, `action`, `description`, `ip_address`) VALUES ('2', 'LOGIN', 'User logged into the system.', '::1')