app/Models/ChatNotificationModel.php

SELECT SUM(`unread_count`) AS `unread_count`
FROM `chat_participants`
WHERE `user_id` = '2'
---
    public function getUnreadCount($userId)
    {
        $db = \Config\Database::connect();
        return $db->table('chat_participants')
            ->where('user_id', $userId)
            ->selectSum('unread_count')
            ->get()
            ->getRowArray()['unread_count'] ?? 0;