app/Models/ConversationModel.php

SELECT `cc`.*, `cp`.`chat_role`, `cp`.`unread_count`, `cp`.`is_muted`
FROM `chat_participants` `cp`
JOIN `chat_conversations` `cc` ON `cc`.`id` = `cp`.`conversation_id`
WHERE `cp`.`user_id` = '12'
AND `cc`.`is_active` = 1
ORDER BY `cc`.`last_message_at` DESC
---
    public function getConversationsForUser($userId)
    {
        return $this->db->table('chat_participants cp')
            ->select('cc.*, cp.chat_role, cp.unread_count, cp.is_muted')
            ->join('chat_conversations cc', 'cc.id = cp.conversation_id')
            ->where('cp.user_id', $userId)
            ->where('cc.is_active', 1)
            ->orderBy('cc.last_message_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `chat_participants`
WHERE `conversation_id` = '3'
AND `user_id` = '12'
---
    public function isParticipant($convId, $userId)
    {
        return $this->db->table('chat_participants')
            ->where('conversation_id', $convId)
            ->where('user_id', $userId)
            ->countAllResults() > 0;