app/Models/CourseModel.php

    public function getStats()
    {
        $stats = [
            'total' => $this->countAll(),
            'active' => $this->where('status', 'Active')->countAllResults(),
            'inactive' => $this->where('status', 'Inactive')->countAllResults(),
            'by_dept' => $this->select('department, COUNT(*) as count')->groupBy('department')->findAll(),
            'by_sem' => $this->select('semester, COUNT(*) as count')->groupBy('semester')->orderBy('semester', 'ASC')->findAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `status` = 'Active'
AND `courses`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `status` = 'Inactive'
AND `courses`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows` FROM `courses`
SELECT `department`, COUNT(*) as count
FROM `courses`
WHERE `courses`.`deleted_at` IS NULL
GROUP BY `department`
SELECT `semester`, COUNT(*) as count
FROM `courses`
WHERE `courses`.`deleted_at` IS NULL
GROUP BY `semester`
ORDER BY `semester` ASC