app/Models/Marks_model.php

    public function getStudentMarks($student_id)
    {
        return $this->select('marks.*, subjects.subject_name, users.name as teacher_name')
            ->join('subjects', 'subjects.id = marks.subject_id')
            ->join('users', 'users.id = marks.updated_by')
            ->where('student_id', $student_id)
            ->findAll();
---
SELECT `marks`.*, `subjects`.`subject_name`, `users`.`name` as `teacher_name`
FROM `marks`
JOIN `subjects` ON `subjects`.`id` = `marks`.`subject_id`
JOIN `users` ON `users`.`id` = `marks`.`updated_by`
WHERE `student_id` = '4'