app/Models/MessageModel.php

SELECT `chat_messages`.*, `users`.`name` as `sender_name`
FROM `chat_messages`
JOIN `users` ON `users`.`id` = `chat_messages`.`sender_id`
WHERE `conversation_id` = '3'
AND `chat_messages`.`id` > '15'
AND `is_deleted` = 0
ORDER BY `chat_messages`.`created_at` ASC
---
    public function getNewMessagesSince($convId, $lastMsgId)
    {
        $messages = $this->select('chat_messages.*, users.name as sender_name')
            ->join('users', 'users.id = chat_messages.sender_id')
            ->where('conversation_id', $convId)
            ->where('chat_messages.id >', $lastMsgId)
            ->where('is_deleted', 0)
            ->orderBy('chat_messages.created_at', 'ASC')
            ->findAll();