app/Models/StudentBusModel.php

    public function getStudentBusInfo($studentId)
    {
        return $this->select('student_bus.*, bus_routes.route_name, bus_routes.driver_name, bus_routes.driver_phone, bus_routes.status, bus_stops.stop_name, bus_stops.arrival_time')
            ->join('bus_routes', 'bus_routes.id = student_bus.route_id', 'left')
            ->join('bus_stops', 'bus_stops.id = student_bus.stop_id', 'left')
            ->where('student_id', $studentId)
            ->first();
---
SELECT `student_bus`.*, `bus_routes`.`route_name`, `bus_routes`.`driver_name`, `bus_routes`.`driver_phone`, `bus_routes`.`status`, `bus_stops`.`stop_name`, `bus_stops`.`arrival_time`
FROM `student_bus`
LEFT JOIN `bus_routes` ON `bus_routes`.`id` = `student_bus`.`route_id`
LEFT JOIN `bus_stops` ON `bus_stops`.`id` = `student_bus`.`stop_id`
WHERE `student_id` = '4'
 LIMIT 1