app/Models/User_model.php

    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'kumarsasi9081@gmail.com'
 LIMIT 1